ci(docs): made a few minor changes to README.md
